# 44: Menata ulang penempatan kolom pada Data Frame

In [ ]:
Cindy Amelia Saputra - 2273011

In [ ]:
Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.4
1.21.5

In [ ]:
Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  6  6  1  7  5
1  1  4  1  5  8
2  9  1  8  9  9
3  9  4  4  7  8
4  3  8  8  8  8

In [ ]:
Menata ulang penempatan kolom pada Data Frame

In [3]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  7  1  6  5  6
1  5  1  1  8  4
2  9  8  9  9  1
3  7  4  9  8  4
4  8  8  3  8  8

In [4]:
df

   A  B  C  D  E
0  6  6  1  7  5
1  1  4  1  5  8
2  9  1  8  9  9
3  9  4  4  7  8
4  3  8  8  8  8

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  7  1  6  5  6
1  5  1  1  8  4
2  9  8  9  9  1
3  7  4  9  8  4
4  8  8  3  8  8